
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиИмущества Расход
	Движения.ОстаткиИмущества.Записывать = Истина;
	Движение = Движения.ОстаткиИмущества.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Кабинет = КабинетОтправитель;
	Движение.МОЛ = КабинетОтправитель;

	// регистр ОстаткиИмущества Приход
	Движения.ОстаткиИмущества.Записывать = Истина;
	Движение = Движения.ОстаткиИмущества.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Кабинет = КабинетПолучатель;
	Движение.МОЛ = МОЛПолучатель;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
